app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists" WHERE (lang LIKE '%c%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "gists"
---
  def index
    @gists = Gist.paginate(:page => params[:page]).search(params[:search])

INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 09 Mar 2014 12:54:40 UTC +00:00], ["description", "wefsd"], ["lang", "sfdsfds"], ["snippet", "adfsdfafafasdfds"], ["updated_at", Sun, 09 Mar 2014 12:54:40 UTC +00:00]]
---
  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save

UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 2
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]
---
  def destroy
    @gist.destroy

SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_gist
      @gist = Gist.find(params[:id])